[
    {
        "title": "Melee CSS Color Changer",
        "image": "meleeCssColorChanger.jpg",
        "technologies": [
            "Java",
            "JavaFX"
        ],
        "description": "Melee CSS Color Changer is used to change various colors on the character select screen of Super Smash Bros. Melee. The user just provides the appropriate MnSlChr.usd and adjusts the colors for background, top frame, bottom frame, rules, cursor, and the many \"selects\" in the background.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/Melee-CSS-Color-Changer"
    },
    {
        "title": "The Digit-Inator",
        "image": "digit-inator.png",
        "technologies": [
            "Python",
            "TypeScript",
            "React",
            "Next.js",
            "TensorFlow.js",
            "SCSS Modules",
            "Jest",
            "React Testing Library",
            "Cypress",
            "TensorFlow",
            "Keras",
            "MNIST dataset",
            "Convolutional Neural Network (CNN)",
            "Adobe XD"
        ],
        "description": "The Digit-Inator allows you to convert your favorite hand drawn digit to text with the latest and greatest in computer vision. The user simply just draws a number using their mouse or touch screen and the Digit-Inator gives its best guess at what the number is.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/Digit-Inator",
        "siteUrl": "https://digit-inator.netlify.app/"
    },
    {
        "title": "Melee Notes Web App",
        "image": "meleeNotesWeb.jpg",
        "technologies": [
            "C#",
            "TypeScript",
            "ASP.NET Core",
            "ReactJS",
            "Entity Framework Core",
            "SCSS",
            "Bootstrap",
            "PostgreSQL",
            "Jest",
            "Enzyme",
            "Gulp",
            "Webpack"
        ],
        "description": "Melee Notes is a full stack note taking web app for competitive Super Smash Bros. Melee players. It lets users record their tournaments, sets, and games then that data can be taken to query statistics based on user specifications, such as character, stage, player, date, and more.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/Melee-Notes-Web-App"
    },
    {
        "title": "West Virginia RV",
        "image": "westVirginiaRV.jpg",
        "technologies": [
            "Java",
            "FXML",
            "MySQL"
        ],
        "description": "The main purpose of this app is to keep track of rental property. A client's property position, contact information, bills, and payment status (based on weekly or monthly periods); as well as the general upkeep and utility bills for the property as a whole are recorded.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/West-Virginia-RV"
    },
    {
        "title": "Fast Twitch Games",
        "image": "fastTwitchGames.jpg",
        "technologies": [
            "JavaScript",
            "ReactJS",
            "Redux"
        ],
        "description": "A chrome extension using Twitch API that quickly links to people streaming your favorite video games. The extension stores your games in local storage for easy access and displays the twitch user, stream title, view count, and stream thumbnail for each stream of a specified game.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/Fast-Twitch-Games-ReactJS-with-Redux"
    },
    {
        "title": "Melee Notes - Desktop App",
        "image": "meleeNotes.jpg",
        "technologies": [
            "Java",
            "JavaFX",
            "JUnit",
            "SQLite"
        ],
        "description": "Melee Notes is a note app for competitive Super Smash Bros. Melee players. It lets users record tournaments, sets, and games taking data from these records to query statistics based on user specifications for more than 5 different fields. The app also allows for notes to be taken about players, characters, analysis, and mentality alongside reports on tournaments and money earned.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/Melee-Notes"
    },
    {
        "title": "Basic Search Engine",
        "image": "searchEngine.jpg",
        "technologies": [
            "C"
        ],
        "description": "This program crawls web pages given in a .txt file and indexes them. Then the user can add terms to search for and the top 3 most relevant pages are displayed, according to their tf-idf score.",
        "gitHubUrl": "https://github.com/RodneyMcQuain/Search-Engine"
    }
]